---
type: LinePatternSegment
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# LinePatternSegment

`Autodesk.Revit.DB.LinePatternSegment` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | LinePatternSegment | — | `` |
| Constructor | LinePatternSegment | — | `public LinePatternSegment ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Length | — | `public double Length { get ; set ; }` |
| Property | Type | — | `public LinePatternSegmentType Type { get ; set ; }` |